// See https://aka.ms/new-console-template for more information

/*Каждый игрок имеет выбирает 1 персонаж из 3х
 В партии игры учавствуют 2 игрока, которые по очереди делают ходы
 Для того, чтобы сделать ход, необходимо для своего игрока вызвать
 метод MakeMove(MoveType moveType, Person person), куда необходимо 
 передать персонаж соперника и желаемый тип хода. 
 После завершения хода, ход переходит к сопернику. 
 Выйигрывает тот игрок, соперник которого потеряет все жизни. 
 */
Console.WriteLine("Hello, World!");